Revit 2020 API
SchemaCommon Members
The SchemaCommon type exposes the following members.
Properties
Name | Description
BaseSchema
 The property labeled "BaseSchema" from the "PrismTransparent" schema.
Category
 The property labeled "Category" from the "PrismTransparent" schema.
Description
 The property labeled "Description" from the "PrismTransparent" schema.
Hidden
 The property labeled "Hidden" from the "PrismTransparent" schema.
Keyword
 The property labeled "Keyword" from the "PrismTransparent" schema.
Thumbnail
 The property labeled "Thumbnail" from the "PrismTransparent" schema.
UIName
 The property labeled "UIName" from the "PrismTransparent" schema.
VersionGUID
 The property labeled "VersionGUID" from the "PrismTransparent" schema.
See Also
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace